//******************************************************************************
// Interrupt Service Routines.
//******************************************************************************
#include "stm32f1xx_hal.h"
#include "stm32f1xx.h"
#include "stm32f1xx_it.h"

extern PCD_HandleTypeDef hpcd_USB_FS;



//******************************************************************************
// This function handles Non maskable interrupt.
//******************************************************************************
void NMI_Handler(void) { }
//******************************************************************************

//******************************************************************************
// This function handles Hard fault interrupt.
//******************************************************************************
void HardFault_Handler(void) { while (1) { } }
//******************************************************************************

//******************************************************************************
// This function handles Memory management fault.
//******************************************************************************
void MemManage_Handler(void){ while (1) { } }
//******************************************************************************

//******************************************************************************
// This function handles Prefetch fault, memory access fault.
//******************************************************************************
void BusFault_Handler(void) { while (1) { } }
//******************************************************************************

//******************************************************************************
// This function handles Undefined instruction or illegal state.
//******************************************************************************
void UsageFault_Handler(void){ while (1) { } }
//******************************************************************************

//******************************************************************************
// This function handles System service call via SWI instruction.
//******************************************************************************
void SVC_Handler(void){ while (1) { } }
//******************************************************************************

//******************************************************************************
// This function handles Debug monitor.
//******************************************************************************
void DebugMon_Handler(void) { }
//******************************************************************************

//******************************************************************************
// This function handles Pendable request for system service.
//******************************************************************************
void PendSV_Handler(void) { }
//******************************************************************************

//******************************************************************************
// This function handles System tick timer.
//******************************************************************************
void SysTick_Handler(void)
{
  HAL_IncTick();
  HAL_SYSTICK_IRQHandler();
}
//******************************************************************************

/**
  * @brief This function handles USB high priority or CAN TX interrupts.
  */
void USB_HP_CAN1_TX_IRQHandler(void)
{
  /* USER CODE BEGIN USB_HP_CAN1_TX_IRQn 0 */

  /* USER CODE END USB_HP_CAN1_TX_IRQn 0 */
  HAL_PCD_IRQHandler(&hpcd_USB_FS);
  /* USER CODE BEGIN USB_HP_CAN1_TX_IRQn 1 */

  /* USER CODE END USB_HP_CAN1_TX_IRQn 1 */
}

/**
  * @brief This function handles USB low priority or CAN RX0 interrupts.
  */
void USB_LP_CAN1_RX0_IRQHandler(void)
{
  /* USER CODE BEGIN USB_LP_CAN1_RX0_IRQn 0 */

  /* USER CODE END USB_LP_CAN1_RX0_IRQn 0 */
  HAL_PCD_IRQHandler(&hpcd_USB_FS);
  /* USER CODE BEGIN USB_LP_CAN1_RX0_IRQn 1 */

  /* USER CODE END USB_LP_CAN1_RX0_IRQn 1 */
}


//******************************************************************************
// Обработчик внешнего прерывания на линии 3
//******************************************************************************
void EXTI3_IRQHandler(void)
{
  HAL_GPIO_EXTI_IRQHandler(GPIO_PIN_3);
}
//******************************************************************************


